<?
echo "<h4>1) </h4>";

$a = 0;
while ($a <= 100) {
	echo ($a%3==0)?"$a ":"";
	$a++;
} 
//////////////////////////////////////////////////////////////

echo "<h4>2) </h4>";
$i = 0;
do{
	if($i==0){
		echo "<p>$i - то ноль.</p>";
	}
	elseif($i%2==0){
		echo "<p>$i - четное число.</p>";
	}
	else{
		echo "<p>$i - нечетное число.</p>";
	}
	$i++;
}while($i<=10);
//////////////////////////////////////////////////////////////

echo "<h4>3) </h4>";

$arrCity = [
	"Московская область"=>["Москва","Зеленоград","Клин"],
	"Ленинградская область"=>["Санкт-Петербург","Всеволжск","Павловск","Кронштадт"],
	"Рязанская область"=>["Рязань","Ряжск","Сасово"],
	"Новосибирская область"=>["Новосибирск","Татарск","Обь"]
];

foreach ($arrCity as $key => $value) {
	echo "<b>$key:</b><br>";
	$strCity="";
	foreach ($value as $key => $value) {
		$strCity.="$value, ";
	}
	$strCity = preg_replace("/, $/","",$strCity);
	echo "$strCity<br><br>";
}
//////////////////////////////////////////////////////////////
/*
echo "<h4>4) </h4>";

function transLtr($text){
	$arrLtr = [
		'а'=>'a', 'б'=>'b', 'в'=>'v', 'г'=>'g', 'д'=>'d', 
		'е'=>'e', 'ё'=>'ye', 'ж'=>'zh', 'з'=>'z', 'и'=>'i',
		'й'=>'yi', 'к'=>'k', 'л'=>'l', 'м'=>'m', 'н'=>'n',
		'о'=>'o', 'п'=>'p', 'р'=>'r', 'с'=>'s', 'т'=>'t',
		'у'=>'u', 'ф'=>'f', 'х'=>'kh', 'ц'=>'tc', 'ч'=>'ch',
		'ш'=>'sh', 'щ'=>'shch', 'ы'=>'y', 'э'=>'e', 'ю'=>'yu',
		'я'=>'ya'	
	];

	$res = "";
	
	for($i=0;$i<mb_strlen($text);$i++){
		
	}
	return $res;
}

$txt='тест';
$txt=mb_convert_encoding($txt, 'UTF-8');
$result=transLtr($txt);

echo "<b>Сообщение RUS:</b> <br>$txt<br><br>";
echo "<b>Транслитерация ENG:</b> <br>$result<br>";
*/
//////////////////////////////////////////////////////////////

echo "<h4>5) </h4>";

$txt="This is line with space";
$result = preg_replace("/ /","_",$txt);

echo "<b>Строка с пробелами:</b> <br>$txt<br><br>";
echo "<b>Заменены пробелы на \"_\":</b> <br>$result<br>";
//////////////////////////////////////////////////////////////